ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/am243x/MCSPI4_CFG.xml
	<register id="CFG_IRQENABLE" acronym="CFG_IRQENABLE" offset="0x11C" width="32" description="This register allows to enable/disable the module internal sources of interrupt, on an event-by-event basis. ">
		<bitfield id="RESERVED" width="14" begin="31" end="18" resetval="0x0" description="Reads return 0" range="31 - 18" rwaccess="N/A"/> 
		<bitfield id="EOW_ENABLE" width="1" begin="17" end="17" resetval="0x0" description="End of Word count Interrupt Enable" range="17" rwaccess="R/W"/> 
		<bitfield id="WKE" width="1" begin="16" end="16" resetval="0x0" description="Wake Up event interrupt Enable in slave mode when an active control signal is detected on the SPIEN line programmed in the field MCSPI_CH0CONF[SPIENSLV]" range="16" rwaccess="R/W"/> 
		<bitfield id="RESERVED" width="1" begin="15" end="15" resetval="0x0" description="Reads returns 0" range="15" rwaccess="N/A"/> 
		<bitfield id="RX3_FULL_ENABLE" width="1" begin="14" end="14" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 3" range="14" rwaccess="R/W"/> 
		<bitfield id="TX3_UNDERFLOW_ENABLE" width="1" begin="13" end="13" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 3" range="13" rwaccess="R/W"/> 
		<bitfield id="TX3_EMPTY_ENABLE" width="1" begin="12" end="12" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch3" range="12" rwaccess="R/W"/> 
		<bitfield id="RESERVED" width="1" begin="11" end="11" resetval="0x0" description="Reads return 0" range="11" rwaccess="N/A"/> 
		<bitfield id="RX2_FULL_ENABLE" width="1" begin="10" end="10" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 2" range="10" rwaccess="R/W"/> 
		<bitfield id="TX2_UNDERFLOW_ENABLE" width="1" begin="9" end="9" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 2" range="9" rwaccess="R/W"/> 
		<bitfield id="TX2_EMPTY_ENABLE" width="1" begin="8" end="8" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch 2" range="8" rwaccess="R/W"/> 
		<bitfield id="RESERVED" width="1" begin="7" end="7" resetval="0x0" description="Reads return 0" range="7" rwaccess="N/A"/> 
		<bitfield id="RX1_FULL_ENABLE" width="1" begin="6" end="6" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 1" range="6" rwaccess="R/W"/> 
		<bitfield id="TX1_UNDERFLOW_ENABLE" width="1" begin="5" end="5" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 1" range="5" rwaccess="R/W"/> 
		<bitfield id="TX1_EMPTY_ENABLE" width="1" begin="4" end="4" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch 1" range="4" rwaccess="R/W"/> 
		<bitfield id="RX0_OVERFLOW_ENABLE" width="1" begin="3" end="3" resetval="0x0" description="Receiver register Overflow Interrupt Enable Ch 0" range="3" rwaccess="R/W"/> 
		<bitfield id="RX0_FULL_ENABLE" width="1" begin="2" end="2" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 0" range="2" rwaccess="R/W"/> 
		<bitfield id="TX0_UNDERFLOW_ENABLE" width="1" begin="1" end="1" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 0" range="1" rwaccess="R/W"/> 
		<bitfield id="TX0_EMPTY_ENABLE" width="1" begin="0" end="0" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch 0" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_WAKEUPENABLE" acronym="CFG_WAKEUPENABLE" offset="0x120" width="32" description="The wakeup enable register allows to enable/disable the module internal sources of wakeup on event-by-event basis. ">
		<bitfield id="RESERVED_18" width="31" begin="31" end="1" resetval="0x0" description="Reads returns 0" range="31 - 1" rwaccess="R"/> 
		<bitfield id="WKEN" width="1" begin="0" end="0" resetval="0x0" description="WakeUp functionality in slave mode when an active control signal is detected on the SPIEN line programmed in the field MCSPI_CH0CONF[SPIENSLV]" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_SYST" acronym="CFG_SYST" offset="0x124" width="32" description="This register is used to check the correctness of the system interconnect either internally to peripheral bus, or externally to device IO pads, when the module is configured in system test (SYSTEST) mode. ">
		<bitfield id="RESERVED" width="20" begin="31" end="12" resetval="0x0" description="Reads returns 0" range="31 - 12" rwaccess="N/A"/> 
		<bitfield id="SSB" width="1" begin="11" end="11" resetval="0x0" description="Set status bit" range="11" rwaccess="R/W"/> 
		<bitfield id="SPIENDIR" width="1" begin="10" end="10" resetval="0x0" description="Set the direction of the SPIEN[3:0] lines and SPICLK line" range="10" rwaccess="R/W"/> 
		<bitfield id="SPIDATDIR1" width="1" begin="9" end="9" resetval="0x0" description="Set the direction of the SPIDAT[1]" range="9" rwaccess="R/W"/> 
		<bitfield id="SPIDATDIR0" width="1" begin="8" end="8" resetval="0x0" description="Set the direction of the SPIDAT[0]" range="8" rwaccess="R/W"/> 
		<bitfield id="WAKD" width="1" begin="7" end="7" resetval="0x0" description="SWAKEUP output [signal data value of internal signal to system] The signal is driven high or low according to the value written into this register bit" range="7" rwaccess="R/W"/> 
		<bitfield id="SPICLK" width="1" begin="6" end="6" resetval="0x0" description="SPICLK line [signal data value] If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the CLKSPI line [high or low], and a write into this bit has no effect If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the CLKSPI line is driven high or low according to the value written into this register" range="6" rwaccess="R/W"/> 
		<bitfield id="SPIDAT_1" width="1" begin="5" end="5" resetval="0x0" description="SPIDAT[1] line [signal data value] If MCSPI_SYST[SPIDATDIR1] = 0 [output mode direction], the SPIDAT[1] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIDATDIR1] = 1 [input mode direction], this bit returns the value on the SPIDAT[1] line [high or low], and a write into this bit has no effect " range="5" rwaccess="R/W"/> 
		<bitfield id="SPIDAT_0" width="1" begin="4" end="4" resetval="0x0" description="SPIDAT[0] line [signal data value] If MCSPI_SYST[SPIDATDIR0] = 0 [output mode direction], the SPIDAT[0] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIDATDIR0] = 1 [input mode direction], this bit returns the value on the SPIDAT[0] line [high or low], and a write into this bit has no effect " range="4" rwaccess="R/W"/> 
		<bitfield id="SPIEN_3" width="1" begin="3" end="3" resetval="0x0" description="SPIEN[3] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[3] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[3] line [high or low], and a write into this bit has no effect" range="3" rwaccess="R/W"/> 
		<bitfield id="SPIEN_2" width="1" begin="2" end="2" resetval="0x0" description="SPIEN[2] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[2] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[2] line [high or low], and a write into this bit has no effect" range="2" rwaccess="R/W"/> 
		<bitfield id="SPIEN_1" width="1" begin="1" end="1" resetval="0x0" description="SPIEN[1] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[1] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[1] line [high or low], and a write into this bit has no effect" range="1" rwaccess="R/W"/> 
		<bitfield id="SPIEN_0" width="1" begin="0" end="0" resetval="0x0" description="SPIEN[0] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[0] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[0] line [high or low], and a write into this bit has no effect" range="0" rwaccess="R/W"/>
	</register>
