ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/am243x/MCSPI4_CFG.xml
	<register id="CFG_TX3" acronym="CFG_TX3" offset="0x174" width="32" description="This register contains a single SPI word to transmit on the serial link,  what ever SPI word length is. ">
		<bitfield id="TDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 3 Data to transmit" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_RX3" acronym="CFG_RX3" offset="0x178" width="32" description="This register contains a single SPI word received through the serial link, what ever SPI word length is. ">
		<bitfield id="RDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 3 Received Data" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_XFERLEVEL" acronym="CFG_XFERLEVEL" offset="0x17C" width="32" description="This register provides transfer levels needed while using FIFO buffer during transfer.">
		<bitfield id="WCNT" width="16" begin="31" end="16" resetval="0x0" description="Spi word counterThis register holds the programmable value of number of SPI word to be transferred on channel which is using the FIFO bufferWhen transfer had started, a read back in this register returns the current SPI word transfer index" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="AFL" width="8" begin="15" end="8" resetval="0x0" description="Buffer Almost Full This register holds the programmable almost full level value used to determine almost full buffer condition If the user wants an interrupt or a DMA read request to be issued during a receive operation when the data buffer holds at least n bytes, then the buffer MCSPI_MODULCTRL[AFL] must be set with n-1The size of this register is defined by the generic parameter FFNBYTE" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="AEL" width="8" begin="7" end="0" resetval="0x0" description="Buffer Almost EmptyThis register holds the programmable almost empty level value used to determine almost empty buffer condition If the user wants an interrupt or a DMA write request to be issued during a transmit operation when the data buffer is able to receive n bytes, then the buffer MCSPI_MODULCTRL[AEL] must be set with n-1" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_DAFTX" acronym="CFG_DAFTX" offset="0x180" width="32" description="This register contains the  SPI words to transmit on the serial link when FIFO used and DMA address is aligned on 256 bit.This register is an image of one of MCSPI_TX(i) register corresponding to the channel which have its FIFO enabled.">
		<bitfield id="DAFTDATA" width="32" begin="31" end="0" resetval="0x0" description="FIFO Data to transmit with DMA 256 bit aligned address This Register is only is used when MCSPI_MODULCTRL[FDAA] is set to 1 and only one of the MCSPI_CH[i]CONF[FFEW] of enabled channels is set If these conditions are not respected any access to this register return a null value" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_DAFRX" acronym="CFG_DAFRX" offset="0x1A0" width="32" description="This register contains the  SPI words to received on the serial link when FIFO used and DMA address is aligned on 256 bit.This register is an image of one of MCSPI_RX(i) register corresponding to the channel which have its FIFO enabled.">
		<bitfield id="DAFRDATA" width="32" begin="31" end="0" resetval="0x0" description="FIFO Data to transmit with DMA 256 bit aligned address This Register is only is used when MCSPI_MODULCTRL[FDAA] is set to 1 and only one of the MCSPI_CH[i]CONF[FFEW] of enabled channels is set If these conditions are not respected any access to this register return a null value" range="31 - 0" rwaccess="R"/>
	</register>
</module>